#include <fstream>
#include <iostream>
#include <random>
#include <string>
#include <vector>
#include <ctime>

#include <algorithm>

int getRandomNumber(int min, int max) {
    //주어진 숫자중 랜던 숫자 고르기
    static std::mt19937 mt(static_cast<long unsigned int>(time(0)));
    std::uniform_int_distribution<int> dist(min, max);
    return dist(mt);
}

std::string getRandomName() {
    //이름 배열 준비
    std::vector<std::string> firstNames = { "김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "하", "고", "배", "유", "지",
  "서", "전", "문", "송", "황", "오", "신", "조", "남", "탁", "맹", "현", "백", "유", "구",
  "노", "도", "손", "안", "민", "홍", "육", "엄", "장", "염", "성", "차", "우", "주", "구",
  "양", "원", "인", "편", "염", "송", "허", "마", "길", "방", "여", "편", "양", "모", "변",
  "여", "선", "표", "류", "소", "호", "강", "안", "창", "마", "길", "주", "조", "오", "신",
  "변", "허", "석", "성", "목", "표", "남", "탁", "현", "손", "구", "금", "동", "봉", "서",
  "함", "형", "노", "곽", "도", "흥", "주", "홍", "추", "석", "윤", "손", "하", "염", "빈",
  "노", "육", "석", "송", "곽", "여", "편", "흥", "안", "윤", "허", "신", "채", "동", "빈",
  "변", "원", "목", "방", "양", "성", "호", "차", "허", "손", "표", "엄", "흥", "구", "주",
  "신", "차", "민", "여", "석", "추", "형", "금", "함", "모", "채", "허", "인", "방", "유",
  "노", "성", "표", "민", "류", "변", "추", "강", "양", "맹", "육", "목", "형", "동", "안",
  "류", "석", "금", "허", "봉", "채", "호", "차", "모", "여", "백", "방", "우", "엄", "류",
  "여", "추", "형", "백", "마", "함", "원", "허", "봉", "채" };
    std::vector<std::string> nameFirstParts = { "민", "서", "예", "도", "시", "주", "하", "지", "태", "유", "우", "지", "은", "성", "찬", "성", "빈", "승", "환", "창",
  "나", "솔", "영", "라", "진", "연", "율", "리", "아", "오", "경", "혜", "석", "재", "현", "후", "선", "호", "미", "규",
  "진", "윤", "훈", "효", "정", "겸", "희", "건", "무", "별", "람", "단", "봉", "옥", "준", "명", "학", "송", "래", "병",
  "우", "란", "환", "율", "권", "훈", "희", "건", "양", "욱", "련", "솔", "애", "여", "란", "랑", "형", "강", "조", "구",
  "하", "도", "주", "사", "로", "리", "비", "웅", "재", "단", "균", "훤", "모", "구", "영", "강", "돈", "창", "근", "여",
  "서", "원", "기", "판", "휘", "실", "매", "제", "광", "정", "권", "태", "돌", "풍", "요", "율", "리", "림", "루", "배",
  "호", "흔", "길", "예", "린", "란", "화", "수", "염", "신", "륜", "범", "선", "열", "웅", "덕", "문", "찬", "온", "곤",
  "진", "범", "완", "봉", "엽", "혁", "린", "지", "원", "명", "희", "순", "혜", "비", "재", "욱", "경", "남", "본", "진",
  "휘", "일", "무", "휴", "헌", "엽", "홍", "림", "빈", "해", "호", "람", "안", "영", "달", "성", "찬", "림", "겸", "관" };
    std::vector<std::string> nameSecondParts = { "민", "수", "진", "훈", "혁", "현", "영", "호", "후", "하", "희", "헌", "린", "윤", "은", "우", "욱", "원", "울", "렬",
  "안", "언", "연", "온", "옥", "완", "용", "원", "웅", "위", "유", "율", "은", "익", "인", "일", "임", "응", "자", "장",
  "재", "전", "정", "제", "조", "종", "주", "준", "중", "지", "진", "찬", "창", "철", "초", "총", "최", "춘", "탁", "학",
  "한", "항", "해", "혜", "호", "화", "환", "홍", "현", "형", "흠", "흥", "효", "후", "훤", "휘", "희", "흔", "힘", "혁",
  "남", "녕", "노", "누", "늘", "니", "달", "담", "덕", "도", "동", "두", "라", "란", "람", "랑", "래", "로", "록", "룡",
  "류", "률", "륜", "률", "리", "림", "마", "만", "명", "묘", "미", "민", "백", "병", "보", "봉", "부", "비", "빈", "사",
  "산", "삼", "상", "새", "서", "석", "선", "설", "성", "세", "소", "솔", "송", "숙", "순", "승", "시", "신", "아", "애",
  "양", "어", "엄", "여", "역", "연", "열", "염", "예", "오", "옥", "왕", "요", "용", "우", "운", "웅", "원", "월", "위",
  "유", "윤", "율", "융", "은", "을", "음", "응", "의", "이", "익", "인", "일", "임", "잎", "자", "잔", "장", "재", "전" };
    
    //이름의 음절에 랜덤 글자 선택
    std::string firstName = firstNames[getRandomNumber(0, firstNames.size() - 1)];
    std::string namePart1 = nameFirstParts[getRandomNumber(0, nameFirstParts.size() - 1)];
    std::string namePart2 = nameSecondParts[getRandomNumber(0, nameSecondParts.size() - 1)];
    //중간 음절과 마지막 음절의 같은 경우 다시 뽑기
    while (namePart1 == namePart2) {
        namePart2= nameSecondParts[getRandomNumber(0, nameSecondParts.size() - 1)];
    }

    return firstName + namePart1 + namePart2;
}

std::string getRandomPhoneNumber() {
    //숫자의 범위는 1000부터인데 0001로 시작하면 네자리 번호로 고정할수가 없음.
    int middleNumber = getRandomNumber(1000, 9999);
    int lastNumber = getRandomNumber(1000, 9999);
    return "010-" + std::to_string(middleNumber) + "-" + std::to_string(lastNumber);
}

int main() {
    //필요한 주소록의 갯수 입력
    int Num = 0;
    std::cout << "필요한 주소록의 갯수를 입력하세요." << std::endl;
    std::cin >> Num;
    //쓸 파일을 열기
    std::ofstream outputFile("random_contacts.txt");

    if (!outputFile.is_open()) {
        std::cerr << "Failed to open file for writing." << std::endl;
        return 1;
    }
    //파일에 쓰기
    for (int i = 0; i < Num; ++i) {
        std::string name = getRandomName();
        std::string phoneNumber = getRandomPhoneNumber();

        outputFile << name << " " << phoneNumber << "\n";
    }
    //파일 닫기
    outputFile.close();
    std::cout << "Contacts saved to random_contacts.txt" << std::endl;

    return 0;
}